{
    "christmas": [
        "En Navidad, los copos de nieve caen suavemente sobre el teclado mientras Santa Claus prepara su trineo para repartir alegría por todo el mundo.",
        "Los renos de Santa corren veloces por el cielo estrellado, guiados por la nariz roja de Rudolph, llevando regalos a todos los niños.",
        "El árbol de Navidad brilla con luces de colores y adornos brillantes, rodeado de paquetes envueltos con amor y esperanza."
    ],
    "halloween": [
        "En la noche de Halloween, las calabazas iluminadas sonríen misteriosamente mientras los fantasmas recorren las calles pidiendo truco o trato.",
        "Un gato negro cruza el camino bajo la luna llena, mientras las brujas vuelan en sus escobas hacia el castillo encantado del bosque.",
        "Las telarañas cubren los rincones de la mansión abandonada, donde los esqueletos bailan al ritmo de una música escalofriante."
    ],
    "newyear": [
        "El reloj marca la medianoche y los fuegos artificiales iluminan el cielo para dar la bienvenida a un nuevo año lleno de propósitos y sueños.",
        "Brindamos con alegría por los momentos compartidos y por las nuevas oportunidades que nos esperan en este camino que hoy comienza.",
        "Doce uvas, doce deseos y un corazón lleno de esperanza para afrontar los retos de los próximos trescientos sesenta y cinco días."
    ],
    "valentine": [
        "El amor es como una melodía que suena en el corazón, un sentimiento puro que nos une y nos hace ver la belleza en cada pequeño detalle.",
        "Escribir una carta de amor es plasmar el alma en papel, dejando que las palabras fluyan con la sinceridad de un sentimiento verdadero.",
        "Dos corazones que laten al mismo ritmo, compartiendo risas, sueños y el camino de la vida con la complicidad de los que se aman."
    ],
    "starwars": [
        "Hace mucho tiempo, en una galaxia muy, muy lejana, los caballeros Jedi luchaban por mantener la paz y la justicia usando el poder de la Fuerza.",
        "Que la Fuerza te acompañe en este desafío de mecanografía, donde tus dedos deben ser tan rápidos como un caza estelar Ala-X en pleno combate.",
        "El lado oscuro es tentador, pero la disciplina y la práctica constante te llevarán a convertirte en un verdadero maestro del teclado galáctico."
    ],
    "earthday": [
        "Cuidar nuestro planeta es una responsabilidad compartida, protegiendo los bosques, los océanos y toda la biodiversidad que hace única a la Tierra.",
        "Cada pequeño gesto cuenta para preservar el medio ambiente, desde reciclar hasta reducir nuestro consumo de energía y recursos naturales.",
        "La naturaleza nos regala paisajes increíbles y aire puro; es nuestro deber asegurar que las futuras generaciones también puedan disfrutarlos."
    ],
    "summer": [
        "El sol brilla con fuerza sobre la arena dorada mientras las olas del mar refrescan la orilla en estos largos y luminosos días de verano.",
        "Disfrutar de un helado bajo la sombra de una palmera es el plan perfecto para combatir el calor estival y relajarse con el sonido del océano.",
        "Las noches de verano son mágicas, llenas de estrellas y brisas suaves que nos invitan a soñar despiertos bajo el cielo despejado."
    ],
    "backtoschool": [
        "El olor a libros nuevos y lápices afilados marca el inicio de un curso lleno de aprendizaje, nuevos amigos y emocionantes descubrimientos.",
        "Preparar la mochila con ilusión es el primer paso para afrontar los retos académicos con energía y curiosidad por todo lo que está por venir.",
        "El reencuentro con los compañeros en el patio del colegio llena el aire de risas y anécdotas compartidas durante las vacaciones de verano."
    ],
    "default": [
        "La práctica constante es la clave para dominar cualquier habilidad, especialmente la mecanografía, que requiere paciencia y dedicación diaria.",
        "Tus dedos se deslizan sobre las teclas con la fluidez de un pianista, convirtiendo tus pensamientos en palabras con rapidez and precisión.",
        "Cada error es una oportunidad de aprendizaje, un paso más hacia la perfección en el arte de escribir sin mirar el teclado."
    ]
}